app/controllers/blog_posts_controller.rb

SELECT "blog_posts".* FROM "blog_posts"
---
  def index
    @blog_posts = BlogPost.all

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."user_id" = ?  [["user_id", 5]]
---
  def my_posts
    @blog_posts = BlogPost.where(user_id: current_user.id)

INSERT INTO "blog_posts" ("title", "blog_entry", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @blog_post = BlogPost.new(blog_post_params)

    respond_to do |format|
      if @blog_post.save

UPDATE "blog_posts" SET "user_id" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?  [["user_id", 1], ["updated_at", "2015-02-10 17:19:23.240424"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @blog_post.update(blog_post_params)

SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_blog_post
      @blog_post = BlogPost.find(params[:id])