app/controllers/welcome_controller.rb

SELECT "blog_posts".* FROM "blog_posts"
---
  def random
  	redirect_to blog_post_path(id: rand(1..BlogPost.all.length))

SELECT "users".* FROM "users"
---
  def users
  	@users = User.all